/*
컴퓨터는 마이너스 개념이 없다.
보수 : 두 수를 더해서 최대가 되는 관계
아스키 코드, 유니코드
절대 경로 : 최초, 원점 시작 위치부터(실제위치)
상대경로 : 임의의 위치로부터(실제는 다를 수 있다)
메모리는 1byte 단위로 번호를 붙친다(0번부터)
- stack(정적영역, 함수, 지역변수) : 함수가 실행될 때 생성, 종료될 때 소멸된다
- Heap(동적영역, 할당, 때마다 생성된) : 원하는 곳, 시점에 변수공간을 생성, 원할 때 소멸
C언어의 자료형 : 기본형(값 저장), 참조형(주소 저장) = 포인터형
- char 문자 : 문자 하나를 표현(1byte)
- short 정수 : 정수(2byte)
- int 정수 : 정수(4byte)
- long 정수 : 정수(4byte)
- long long : 정수(8byte)
- float 실수 : 실수(4byte)
- double 실수 : 실수(8byte)
- char *s : 포인터형, 참조형 변수, 주소는 4byte
%_ : 형식지정자 : %d(10진수 정수), %x(16진수 정수), %c(문자 하나), %s(문자열)
%f(실수), %lf(실수, 더블과 같음) *p(주소형, 16진 표현법)


*/